{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "quality_defect",
    "1": "illness",
    "2": "spoilage",
    "3": "contamination",
    "4": "allergen",
    "5": "safe"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "allergen": 4,
    "contamination": 3,
    "illness": 1,
    "quality_defect": 0,
    "safe": 5,
    "spoilage": 2
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.6",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
